Tekla.Structures.ModelInternal.PolycurveSerialization
This class contains methods to serialize/deserialize polycurves

Tekla.Structures.ModelInternal.PolycurveSerialization.DeserializeGeometries(System.Collections.Generic.IList{Tekla.Structures.ModelInternal.dotPolycurvePoint_t})
Deserializes the geometry list from core
pointList: Serialized point list from Core
Returns: Deserialized curve list

Tekla.Structures.ModelInternal.PolycurveSerialization.SerializeGeometries(Tekla.Structures.Geometry3d.Polycurve)
Serializes the points of the polycurve to transmit them to Core
Returns: Serialized points with tags

Tekla.Structures.ModelInternal.PolycurveSerialization.DeserializeOneGeometry(System.Collections.Generic.IList{Tekla.Structures.ModelInternal.dotPolycurvePoint_t},System.Int32)
Gets the geometry that corresponds to the points in the serialized point list
geometryPoints: Points of the geometry
index: Index where geometry starts
Returns: Geometry primitive

Tekla.Structures.ModelInternal.PolycurveSerialization.ToPolycurvePoint(Tekla.Structures.Geometry3d.Point,Tekla.Structures.ModelInternal.PolycurveSerialization.SerializedPointType)
Converts a point into a dotPolycurvePoint_t with the correct point type
point: Point to convert
pointType: Type of the point
Returns: Converted point with the correct tag

Tekla.Structures.ModelInternal.PolycurveSerialization.ToNewPointType(Tekla.Structures.ModelInternal.dotPolycurvePoint_t,Tekla.Structures.ModelInternal.PolycurveSerialization.SerializedPointType)
Converts a dotPolycurvePoint_t to another dotPolycurvePoint_t with a different tag
dotPoint: Point whose tag will be changed
newType: New tag
Returns: New tagged point

Tekla.Structures.ModelInternal.PolycurveSerialization.AppendLinePoints(Tekla.Structures.Geometry3d.LineSegment,System.Collections.Generic.IList{Tekla.Structures.ModelInternal.dotPolycurvePoint_t})
Appends the points of a line segment geometry to the serialized point list
segment: Line geometry
pointList: List where to append

Tekla.Structures.ModelInternal.PolycurveSerialization.AppendArcPoints(Tekla.Structures.Geometry3d.Arc,System.Collections.Generic.IList{Tekla.Structures.ModelInternal.dotPolycurvePoint_t})
Appends the points of an arc geometry to the serialized point list
arc: Arc geometry
pointList: List where to append

Tekla.Structures.ModelInternal.PolycurveSerialization.GetCirclePoint(Tekla.Structures.Geometry3d.Arc,System.Double)
Gets the point of the given circle at the given angle
circle: Input circle
angle: Input angle
Returns: Point on the circle at the given angle

Tekla.Structures.ModelInternal.PolycurveSerialization.AppendCirclePoints(Tekla.Structures.Geometry3d.Arc,System.Collections.Generic.IList{Tekla.Structures.ModelInternal.dotPolycurvePoint_t})
Appends the points of a circle geometry to the serialized point list
circle: Circle geometry
pointList: List where to append